# Brewfile for dotfiles dependencies
# Install with: brew bundle

# CLI Tools
brew "stow"           # Symlink manager for dotfiles
brew "tmux"           # Terminal multiplexer
brew "fzf"            # Fuzzy finder
brew "zoxide"         # Smarter cd command
brew "direnv"         # Directory-based environment variables
brew "fnm"            # Fast Node Manager
brew "atuin"          # Shell history in SQLite
brew "keychain"       # SSH key manager
brew "lazygit"        # Git TUI
brew "ripgrep"        # Fast grep alternative
brew "fd"             # Fast find alternative
brew "bat"            # Better cat with syntax highlighting
brew "eza"            # Modern ls replacement
brew "git"            # Version control

# Optional development tools
brew "neovim"         # Text editor
brew "gh"             # GitHub CLI

# Casks (GUI applications) - uncomment what you need
# cask "iterm2"
# cask "wezterm"
# cask "alacritty"
